{
  "intro": {
    "primary": "I am a computer science student with an early passion for fullstack web development.",
    "secondary": "",
    "facts": [
      {
        "heading": "6+ years of experience",
        "text": "I have over 6 years of experience as a self taught programmer. I also have 2 amazing internships of experience with a strong background in both front-end and back-end web development."
      },
      {
        "heading": "Fullstack skills",
        "text": "I am skilled in a wide range of programming languages and technologies, including React.js, SCSS, SQL, Spring Boot, and GraphQL. I have experience building fullstack web applications from start to finish, and am comfortable working with both front-end and back-end frameworks."
      },
      {
        "heading": "Ambition",
        "text": "I am an ambitious individual with a passion for both web development and machine learning, constantly seeking out new challenges and learning opportunities to further advance my skills and career."
      }

    ]
  },

  "about": {
    "text": [
      "I have 6 years of experience in the tech industry and am always seeking new challenges and opportunities to learn and grow, particularly in web development. It is a constantly evolving field that keeps me engaged and learning."
    ,
      "I am excited about the potential for innovation and growth in the web development industry and committed to staying current with the latest technologies and best practices. I want to be a part of shaping the direction of the industry as it progresses rapidly."
    ,
      "I am a web developer with a strong interest in AI and machine learning. aim to use my skills and expertise to make a meaningful impact at the intersection of these fields and drive innovation in the industry."
    ]
  },

  "education": {
    "school": "University Name",
    "college": "College of Engineering",
    "major": "Computer Science",
    "graduation": "May 2020",
    "location": "City, State"
  },

  "experience": {
    "jobs": [
      {
        "front": {
          "companyName": "Amazon",
          "companyLogo": "/assets/amazon.png",
          "companyHref": "https://tritechsoft.com/",
          "location": "Austin, Texas",
          "duration": "May 2020 - Present",
          "position": "SDE",
          "technologiesUsed": [
            {
              "src": "/assets/angular3.png",
              "alt": "Angular"
            },
            {
              "src": "/assets/ts.png",
              "alt": "TypeScript"
            },
            {
              "src": "/assets/rxjs.png",
              "alt": "RxJs"
            },
            {
              "src": "/assets/jest.png",
              "alt": "Jest"
            },
            {
              "src": "/assets/kotlin.png",
              "alt": "Kotlin"
            },
            {
              "src": "/assets/postgresql.png",
              "alt": "PostgresSQL"
            },
            {
              "src": "/assets/graphql.png",
              "alt": "GraphQL"
            },
            {
              "src": "/assets/docker.png",
              "alt": "Docker"
            },
            {
              "src": "/assets/sass.png",
              "alt": "SCSS"
            }
          ]
        },
        "back": {
          "items": [
            "Contributed 15-35% of the progress each sprint assigned to a team of 7 using Scrum methodology",
            "Accelerated 50% development of frontend features for core products using TypeScript and Angular",
            "Used Kotlin, Spring Boot, and GCP to advance crucial backend services",
            "Created required API endpoints with GraphQL and REST for a complex singe page web app"
          ]
        }
      },
      {
        "front": {
          "companyName": "IBM",
          "companyLogo": "/assets/ibm.png",
          "companyHref": "https://ibm.com/",
          "location": "City, State",
          "duration": "June 2014 - July 2021",
          "position": "Machine Learning Engineer",
          "technologiesUsed": [
            {
              "src": "/assets/html.png",
              "alt": "HTML5"
            },
            {
              "src": "/assets/js.png",
              "alt": "JavaScript"
            },
            {
              "src": "/assets/python.png",
              "alt": "Python"
            },
            {
              "src": "/assets/ubuntu.png",
              "alt": "Ubuntu"
            },
            {
              "src": "/assets/docker.png",
              "alt": "Docker"
            }
          ]
        },
        "back": {
          "items": [
            "Collaborated with 4 other interns to develop microservice-based software with remote and virtual methods",
            "Developed business-oriented project with technologies such as Docker, VirtualBox, Node, Python, and Git to create a Speech-To-Text system"
          ]
        }
      }
    ]
}
}